#/med_contest/preprocessing.py created by: Nikolay Pavlychev pavlychev.n.se@gmail.com
#-----------------------------------------------------------------------------------------------------------------------
print('Import libs...')
import os
import sys
import random
import time
import joblib

import numpy as np
import scipy
import pandas as pd
import sklearn
from sklearn.preprocessing import OneHotEncoder

print('Successfully!')
#-----------------------------------------------------------------------------------------------------------------------
print('Import data...')
ROOT_DIR = os.path.abspath(os.curdir)

cols = ['ID','Пол','Семья','Этнос','Национальность','Религия','Образование','Профессия','Вы_работаете','Выход_на_пенсию','Прекращение_работы_по_болезни','Сахарный_диабет','Гепатит','Онкология','Хроническое_заболевание_легких','Бронжиальная_астма','Туберкулез_легких_','ВИЧ/СПИД','Регулярный_прим_лекарственных_средств','Травмы_за_год','Переломы','Статус_Курения','Возраст_курения','Сигарет_в_день','Пассивное_курение','Частота_пасс_кур','Алкоголь','Возраст_алког','Время_засыпания','Время_пробуждения','Сон_после_обеда','Спорт_клубы','Религия_клубы','ID_y','Артериальная_гипертензия','ОНМК','Стенокардия_ИБС_инфаркт_миокарда','Сердечная_недостаточность','Прочие_заболевания_сердца']
dataset_train = pd.read_csv(ROOT_DIR + '/train_dataset_train/' + 'train.csv', dtype=object,sep=',', header=1, names=cols)

